# TODO пропблема с тестами
# TODO ПРоверка документации и логики
# TODO пропблема с тестами
# TODO Напиши тесты на этот модуль
# TODO Пользователь может удалять конфиги?
# TODO ПРОверка подписки по расписанию и удалять конфиги пользователя? или корректнее писать что не оплачено надо бы оплатить? а что с конфиг файлами делать?
# TODO Внесено много изменений,
#  потому стоит либо написать недостающие тесты,
#   либо поправить существующие
# TODO Напиши тесты на этот модуль  self.mistake_handler_user
